[
  {
    "place": "Cister Catorce",
    "text": "This place is a complete tourist trap, its best to find another place. Their location is absolutely perfect and their menu advertise tapas for $3.50 which they are but the portions are small the quality is very low. I initially ordered tap water which they would not serve me and when I received the bill I understood why for a small bottle of water is $3.95 . I would not recommend this place.",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "AVOID! So sorry I didn't read the reviews before ordering a beer here. Absolute rip off - €3.95 for a small beer and the tapa was extremely poor as well. Would give it 0 stars if I could!",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "We should have known better but we wanted a quick lunch before visiting the Alcazaba. The restaurant was advertising tapas for €3.50, but when they arrived the portions were microscopic. To add insult to injury, we were then charged €3.95 for a basket of stale bread, €3.95 x2 for 0.5l of water and €3.95 each for an espresso and a cafe con leche. I left feeling more hungry than when I went in and thoroughly ripped off. The worst of Malaga. Avoid!",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "We didn’t check the ratings beforehand, and unfortunately, it turned out to be just average. The food tasted below average, especially considering the prices. We were also surprised to be charged €4 for a basic, dry breadbasket that was just brought to the table without being informed it wasn't complimentary. The beer was overpriced compared to other better spots in town.\nSeems like a typical tourist trap.\nSave your money—don’t waste your time here! There are plenty of better places in the city.",
    "rating": 2
  },
  {
    "place": "Cister Catorce",
    "text": "Wish i read the reviews first, saw the tapa sign. Ended up ordering a cold lasaña, bread, tapa and a coke for 25 euros. Not the value for the money. AVOID\n\nThe waiters will talk to you and try to befriend you, distract you from the prices. I paid 3,95 for some dry bread",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "DO NOT DINE HERE!!! Not worth Even one star. We made The mistake of sitting and ordering here. DON'T. We finished only because of The prices. Not The taste.\nRead other reviews.",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "Tourist trap. You see the sign advertising low price tapas and sit down expecting low/average prices, they ask you first what do you want to drink and only after they bring you the menu with no drinks on it only food. Later they charge you 4 euros for a coffee. Also their coffee is terrible.",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "Unfortunately I have to agree with mostt of the other reviews. THe tapas portions were small and all out of a packet. Microwaved croquettes were almost inedible and 3.95E for a coke is almost theft 26E overall was completely over the top. The restaurant is in a good position and management simply seem to ignore the reviews as they know that tourists frequenting the area do so on impulse rather than reading reviews. This is exactly what we did.",
    "rating": 1
  },
  {
    "place": "Cister Catorce",
    "text": "First time I visited place that is rated so low by others 🤭. Nevertheless we really wanted beer and they had. It was very good. When it comes to the food - ham was really good, croquetes also. Patatas bravas very bad because of dry potatoes cooked some time ago. Nice location when you seat outside. Some good staff doing their hard job to serve. I would never rate them so low as they have.",
    "rating": 3
  },
  {
    "place": "Cister Catorce",
    "text": "Definitely a tourist trap. The tapas were low quality .. tasteless food. – dry, cold potatoes with no flavour. I paid €7 for a single glass of fresh orange juice, which I had for £3.50 just ten minutes earlier somewhere else. The place is crowded only because it’s in a spot that’s easy to stumble upon – not because it’s actually good. Wouldn’t recommend.",
    "rating": 1
  }
]